def sun_all( start, end ):
    output = 0
    for i in range(start, end + 1):
        output += i
    return output

print("0 to 100:", sum_all(0, 100))
print("0 to 1000:", sum_all(0, 1000))
print("50 to 100:", sum_all(50, 100))

예외객체
리턴
재귀


예외 객체
예외가 발생했을 때 예외에 관련된 정보가 저장되는 객체

예외객체
예외가 발생했을 때 예외에 관련된 정보가 저장되는 객체

예외 객체
예외가 발생했을 때 예외에 관련된 정보가 저장되는 객체

예외 객체
예외가 발생했을 때 예외에 관련된 정보가 저장되는 객체

함수를 실행했던 위치로 돌아가게 하는 것

함수를 실행했던 위치로 돌아가게 하는 것

리턴
함수를 실행했던 위치로 돌아가게 하는 것

리턴
함수를 실행했던 위치로 돌아가게 하는 것

재귀
함수 내부에서 자기 자신을 호출하는 것



