# 85p. 타입 확인하기 , type( 자료 )
print( type("안녕하세요") ) # <class 'str'>
print( type(123) )
print( type(1.23) )
print( type(True) )
print( type(None) )
print( type([]) )
print( type( {} ) )
print( type( () ) )

# 86p. 문자열 만들기
print( "ABC" ) # 큰 따옴표
print( 'abc' ) # 작은 따옴표
print( """abc """ ) # 줄 바꿈
print("'a','b','c'") # 작은 따옴표 출력
print('"a","b","c"') # 큰 따옴표 출력 
# 큰 따옴표 안 큰 따옴표 출력은 안 됨, 작은 따옴표 안 작은 따옴표 출력도 x
# 이스케이프 문자를 사용하면 위의 내용 가능
# \" : 큰 따옴표 의미
# \' : 작은 따옴표 의미
# \n : 줄 바꿈
# \t : 들여쓰기
# \\ : \ (이거 출력됨)
print( " \" 안녕?? \" ")
print( " \' 하이 \' " )
print( "안녕하세요\n안녕하세용" )
print( "안녕하세요\t안녕하세용" )
print( "\\ \\ \\ \\ \\" )
# 여러 줄을 줄바꿈 처리할 때 
# 이스케이프 문자 \n 대신
# 큰 따옴표 3번 or 작은 따옴표 세번을 사용하면 안에 탭 사용 가능해 \n과 동일하게 처리 가능
# 의도치 않은 빈 줄 막을 때 \쓸 문장 앞 뒤\ 사용하면 됨

# 2. * 반복연산자
print( "안녕" * 3 ) # 안녕안녕안녕
# 3. 인덱싱 , 문자열은 배열/리스틍 이므로 인덱스 존재한다.
# 인덱스란? 0부터 요소들이 저장된 순서 . ** 음수도 가능 **
# "안녕하세요" , 양수: 0~ 4
print( "가나디"[0] )
print( "가나디"[1] )
print( "가나디"[2] )
print( "가나디"[-1] )
print( "가나디"[-2] )
print( "가나디"[-3] )

# 4. 슬라이싱 , 문자열 자르기/일부 추출 , [ 시작인덱스 : 끝인덱스-1 ]
print( "안녕하세요"[0:2] )
print( "안녕하세요"[1:3] )
# 시작인덱스 생략시 0 , 끝인덱스 생략시 마지막 인덱스
print( "안녕하세요"[:3] )
print( "안녕하세요"[1:] )

# 5. 문자열의 길이 , len( 문자열 )
print( len("안녕하세요") )