'''
for i in numbers :
    if i % 2 == 0 :
        print( i,"는 짝수입니다" )
    elif  i % 2 == 1 :  
        print( i,"는 홀수입니다" )
'''

list_a = [ 273, 103, 5, 32, 65, 9, 72, 800, 99 ]
str( i )
len( str(i) )
for i in list_a :
    if len( str(i) ) > 0 :
        print( i,"는",len( str(i) ),"자릿수입니다.")

'''
# p.214 3번
list_a = [ 273, 103, 5, 32, 65, 9, 72, 800, 99 ]
str( i )
str( len(i) )
for i in list_a :
    if len(i) > 0 :
print( "{}는 {}자릿수입니다.".format(i, len(i) ) )
'''


pets = [
    {"name" : "구름" , "age" : 5},
    {"name" : "구름" , "age" : 5},
    {"name" : "구름" , "age" : 5},
    {"name" : "구름" , "age" : 5}
]

'''
텍스트 에디터

글자를 입력할 수 있는 모든 종류의 프로그램
글자를 입력할 수 있는 모든 종류의 프로그램

통합 개발 환경
텍스트 에디터, 코드 실행기를 포함한 프로그램
프로젝트 생성, 자동 코드 완성, 디버깅 기능 제공

개발환경
프로그래밍을 할 수 있는 환경

인터프리터
소스 코드를 한 줄씩 읽어 실행

대화형 셸 (컴퓨터와 상호작용하는 공간)
프롬프트 >>> 코드를 한 줄 한 줄 입력하면 곧바로 실행결과 볼 수 있음

표현식
어떠한 값을 만들어내는 간단한 코드

문장
표현식이 하나 이상 모인 것

키워드
의미 부여된 특별한 단어

식별자
함수, 변수 이름 붙일 때 사용하는 단어

변수
값을 저장할 때 사용하는 식별자

부동 소수점
소수점이 있는 데이터를 저장하는 방식

어떤 자료형을 다른 자료형으로 바꾸는 것
a = int(input())

비교연산자
불을 만드는 연산자

논리연산자
불끼리 연산할 수 있는 연산자

이터러블
반복을 적용할 수 있는 성질
내부에 있는 객체 차례차례 꺼낼 수 있는 객체

비(파괴)적 함수

리턴
함수를 실행했던 위치로 돌아가게 하는 것

매개변수
함수 호출 시 필요한 데이터 외부에서 받기 위해 사용하는 것

키워드 매개변수
출력할 때 매개변수 값 지정

재귀
함수 내부에서 자기 자신 호출

메모화 
재귀 호출에서 한번 연산한 값을 중복해 연산하지 않기 위해
새로운 값을 연산할 때마다 그 결과에 따른 값 저장

트리 
비선형 자료 구조의 일종

스트림
프로그램이 외부 파일, 외부 네트워크 등과 통신할 때 데이터가 흐르는 길

람다
간단한 함수를 쉽게 구현할 수 있는 기능

튜플
다른 자료형과 다르게 결정된 요소를 바꿀 수 없다

스택
기본 자료형이 차곡차곡 정리된 공간

힙
객체 자료형이 저장되어 있는 공간

예외 = 런타임 오류 = 프로그램 실행 중 발생하는 오류

예외 객체
예외가 발생했을 때 예외와 관련된 정보가 저장되는 객체













'''